Repository: 84000/data-translation-memory
Catalog: toh55_84000-the-teaching-on-the-effulgence-of-light.tmx
Source language: bo
Languages: en

source: །མུ་ཏིག་དམར་པོས་ང་མཆོད་པ།
en: Also offer me red pearls;

source: །དུ་མུ་རུ་དང་ཤི་ཁྱི་བའི།
en: “Tumburu and a hundred thousand other devas of music

source: །བརྒྱ་སྟོང་སྙེད་ནི་འདུས་གྱུར་ནས།
en: Gather together

source: །རོལ་མོ་དག་གིས་ང་མཆོད་པ།
en: And worship me with music;

source: །མེ་ཏོག་སྤོས་ཀྱིས་ང་མཆོད་པ།
en: And worship me with offerings of flowers and perfumes;

source: །ས་ཆེན་འཛིན་པ་ཀླུ་ཡི་རྒྱལ།
en: “The nāga king Gandhāra

source: །ལུས་ཕྱེད་དག་ནི་རབ་བསྟན་ནས།
en: Reveals half of his body

source: །ཐལ་སྦྱར་ང་ལ་གུས་པ་ཡང་།
en: And joins his palms respectfully toward me;

source: །ཐམས་ཅད་བཟོད་མཆོག་སྟོབས་ལས་བྱུང་། །ལུས་མེད་སྒྲ་གཅན་ཟིན་ལ་སོགས།
en: All this is the outcome of the strength of my supreme patience.

source: །བྱེ་བ་ཕྲག་ནི་བརྒྱ་སྟོང་རྣམས།
en: “A trillion beings Such as Anaṅga and Rāhula

source: །དང་བའི་སེམས་ཀྱིས་ང་མཆོད་པ།
en: Worship me with minds filled with faith;

source: །གཞོན་ནུ་ཁྱོད་ཀྱིས་འདི་ལྟར་ལྟོས།
en: “Kumāra, you should see

source: །སངས་རྒྱས་འོད་ཟེར་གང་རེག་པ།
en: That whoever is touched by the Buddha’s light rays

source: །སྡུག་བསྔལ་བྲལ་ནས་བདེ་ཐོབ་པ།
en: Becomes freed from suffering and obtains happiness;

source: །ས་མུ་ཏ་དང་རླུང་གི་ལྷ། །བརྒྱ་སྟོང་ནམ་མཁའ་གང་བར་ནི།
en: “Samudra and a hundred thousand Gods of the wind fill the sky

source: །སྤོས་ཀྱི་ཆར་ཕབ་ང་མཆོད་པ།
en: And worship me by showering perfumed rains;

source: །ལྷ་ཡི་འཁོར་ནི་བརྒྱ་སྟོང་དག །ལྷ་ཡི་མེ་ཏོག་གཏོར་མཆོད་དེ།
en: “A hundred thousand divine retinues Worship me by tossing divine flowers,

source: །སྲེད་སྤངས་སངས་རྒྱས་སྟེན་བྱེད་པ།
en: Abandon their cravings, and attend to the buddhas;

source: །ཁྱེད་ཀྱིས་སངས་རྒྱས་རྫུ་འཕྲུལ་དང་། །སྦྱིན་དང་ཚུལ་ཁྲིམས་སྒྲ་བསྒྲགས་ནས།
en: “You also advertise the Buddha’s miraculous power, Generosity, and discipline,

source: །ཐམས་ཅད་ཀུན་དུ་ཐོས་མཛད་པ།
en: Causing everyone to hear about them;

source: །བཟོད་མཆོག་སྟོབས་ལས་བྱུང་བར་ལྟོས།
en: Regard this as the outcome of the strength of my supreme patience. “Everyone gains understanding

source: །ཕུང་པོ་ཁམས་ཀྱི་སྒྲ་དག་དང་། །བདེན་པ་བཞི་ཡི་སྒྲ་དག་གིས། །ཐམས་ཅད་ཀུན་ནི་གོ་མཛད་པ།
en: Through the words related to the aggregates, The elements , and the four truths;

source: །ང་ཡི་རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་ནི།
en: “Through my miraculous powers,

source: །མཁའ་ལས་མིག་ཟད་མཐའ་དག་དང་། །རབ་ཞིའི་སྒྲ་ནི་ཐོས་གྱུར་ཏེ། །སྐྱེ་བའི་མཐའ་ཡང་དེ་བཞིན་ནོ།
en: The words related to the limit of the exhaustion of the eye And utter peace, as well as the limit of its arising, Are heard from the sky.

source: །མཁའ་ལས་མིག་ནི་རྒྱུ་དང་རྐྱེན།
en: ‘The eye arises from causes and conditions;

source: །དེ་ལས་སྐྱེ་ཡང་འགྲོ་འོང་མེད། །དེ་སྐད་དུ་ནི་ཐོས་པར་འགྱུར།
en: It does not come from or go anywhere.’

source: །མཁའ་ལས་མིག་ཞི་རྟོགས་བྱེད་ན།
en: These words will be heard from the sky:

source: །སངས་རྒྱས་རྣམས་ཀྱང་དེ་ལས་སྐྱེས།
en: ‘The buddhas are born from

source: །དེ་སྐད་དུ་ནི་ཐོས་པར་འགྱུར།
en: The realization of the eye’s peace.’

source: །མཁའ་ལས་མིག་ཟད་མཐའ་ཞི་བས།
en: ‘Since the limit of the exhaustion of the eye is peace,

source: །སངས་རྒྱས་རྣམས་ནི་དེ་ལས་སྐྱེས། །དེ་སྐད་དུ་ནི་ཐོས་པར་འགྱུར།
en: The buddhas are born from this realization.’

source: །མཁའ་ལས་མིག་མཐའ་རབ་ཞི་བས།
en: These words will be heard from the sky: ‘Since the limit of the eye is utter peace,

source: །མཁའ་ལས་མིག་སྐྱེ་མཐའ་ཞི་པས།
en: These words will be heard from the sky: ‘Since the limit of the arising of the eye is peace,

source: །མཁའ་ལས་མིག་འཇུག་རབ་ཞི་ན།
en: These words will be heard from the sky: ‘Since the transformation of the eye is peace,

source: །མཁའ་ལས་མིག་ནི་སྐྱེ་ཞི་བས།
en: These words will be heard from the sky: ‘Since the arising of the eye is peace,

source: །མཁའ་ལས་མིག་དབེན་རབ་ཞི་བས།
en: These words will be heard from the sky: ‘Since the disengagement of the eye is peace,

source: །སངས་རྒྱས་རྣམས་ནི་དེ་ལས་སྐྱེས།
en: The buddhas are born from this realization.’

source: །སྒྲ་དང་མིང་ལ་སོགས་པའི་བར།
en: Up to words, names, and so forth.

source: །འདོད་སྡང་གཏི་མུག་ཁོང་ཁྲོ་དང་། །འཆབ་དང་ཕྲག་དོག་གཡོ་སྒྱུ་དང་། །ཁེངས་དང་ང་རྒྱལ་ལ་སོགས་པ།
en: To desire, anger, ignorance, Aggression, pretense, envy, deceit,

source: །རྒྱ་ཆེར་བཤད་པའང་དེ་བཞིན་ནོ།
en: Arrogance, pride, and so forth.”

source: །དེ་ནས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པས་དེ་ལྟ་བུའི་ཆོས་ཁྱད་པར་དུ་འཕགས་པ་ཐོས་པས་རབ་ཏུ་དགའ་བར་གྱུར་ནས་ཐལ་མོ་སྦྱར་ཏེ།
en: When he heard this unique and extraordinary teaching, Candraprabhakumārabhūta was overjoyed.

source: །བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སང་གི་གདུགས་ལ་བདག་དེ་བཞིན་གཤེགས་པ་དང་། འཁོར་མང་པོ་དང་བཅས་པར་གདུགས་ཚོད་ལ་སྤྱན་འདྲེན་ན། ཐུགས་བརྩེ་བར་དགོངས་ཏེ་བདག་གིས་སྦྱར་བའི་གདུགས་ཚོད་གསོལ་བར་ཅི་གནང་།
en: With his palms joined, he said, “Blessed One, if I were to invite the Thus-Gone One and his large retinue for lunch tomorrow, would he consider me with affection and consent to come for the lunch that I will prepare?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གཞོན་ནུ་དེའི་བསམ་པ་རྣམ་པར་དག་པ་དང་། སེམས་ཅན་ཚད་མེད་པ་རྣམས་ལ་ཡང་ཕན་པ་མཛད་པར་འགྱུར་བར་ཐུགས་ཀྱིས་མཁྱེན་ནས་ཐུགས་བརྩེ་བར་དགོངས་ཏེ་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: As he said this, the Blessed One perceived Kumāra’s pure motivation, and he knew that this would benefit countless sentient beings. So, considering him with affection, he gave his consent by not responding.

source: །དེ་ནས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་སྟན་ལས་ལངས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས། རབ་ཏུ་དགའ་བས་རང་གི་ཁྱིམ་དུ་སོང་སྟེ།
en: Candraprabhakumārabhūta then stood up, prostrated at the feet of the Blessed One, circumambulated him three times, and, filled with joy, went back to his home.

source: རང་གི་འཁོར་དང་བཅས་པ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་ལ་སོགས་པས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོའི་བཞི་མདོར་དར་གྱི་ལྡིང་ཁང་བྲེས་ཏེ་ལྡིང་ཁང་དེ་ཡང་ཤིན་ཏུ་མཐོ་ཞིང་རྒྱ་ཆེ་ལ་ཐམས་ཅད་ཀུན་དུ་ཁྱབ་པ།
en: Together with his retinue, and with the help of gods, nāgas, yakṣas, rākṣasas, mahoragas, and other beings, he installed a silken marquee at a crossroads near the city of Rājagṛha. That marquee was very tall and wide, and it covered the whole area.

source: གསེར་གྱི་ཙོང་ཙོང་དྲ་བར་བྲེས་པ། ནོར་བུ་རིན་པོ་ཆེའི་ཕྲེང་བ་སྦྱངས་པ། སེང་གེའི་བ་དན་དང་། གསེར་གྱི་ཕྲེང་བ་ལུ་གུ་རྒྱུད་ཅན་འབུམ་ཕྲག་བརྒྱ་སྟོང་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ།
en: It was decorated with symmetrical golden nets, garlands of precious gems, and lion standards, as well as a billion interwoven golden threads.

source: གཞན་ཡང་རིན་པོ་ཆེའི་མེ་ཏོག་ཁ་དོག་ཁྱད་པར་དུ་འཕགས་པའི་ཕྲེང་བའི་ཕུང་པོ་དག་གཅལ་དུ་བཀྲམ་མོ། །མེ་ཏོག་ཙམ་པ་ཀ་དང་ཨ་ཏི་མུག་ཏ་ལ་སོགས་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཕྲེང་བ་ཚད་མེད་གྲངས་མེད་པ་ཡང་རིན་པོ་ཆེའི་ལྡིང་ཁང་གི་ནང་ཐམས་ཅད་དང་། འཁོར་འདུས་པ་ཐམས་ཅད་ཀུན་ཏུ་ཁྱབ་པར་སྦྱངས་ཤིང་རྒྱན་དུ་བྲེས་སོ། །གཞན་ཡང་དེའི་ནང་དུ་ཁྲི་སྟན་རྣམས་བཤམས་ནས།
en: Heaps of garlands of precious flowers in the most magnificent colors were spread on the floor, and innumerable garlands of other flowers, such as magnolia and rosewood flowers, were hung as ornaments, covering the entire interior of the precious marquee as well as the entire assembly.

source: རིན་པོ་ཆེའི་སྤོས་ཕྱི་ལི་ཀ་དང་། དུ་མ་ཙ་དང་། ཙན་དན་དང་། གུར་གུམ་རྣམ་པར་དག་ཅིང་ཡིད་དགའ་བར་བྱེད་པ་སྣ་ཚོགས་བསྲེགས་སོ།
en: A throne and seats were arranged inside, and a variety of pure and delightful precious fragrant substances, such as pṛkkā, dumaca, sandalwood, and saffron, were burned.

source: །དེ་བཞིན་དུ་སྦྱར་སྤོས་མཆོག་དམ་པ་སྣ་ཚོགས་ཀྱང་མཆོད་པའི་ཡོ་བྱད་དུ་སྦྱར་ཏོ།
en: Different kinds of the most excellent mixed incenses were also prepared as offering substances.

source: །གཞན་ཡང་སྤོས་ཀྱི་ཆུས་ལམ་སྲང་རྣམས་ཀུན་ཏུ་ཁྱབ་པར་ཆག་ཆག་བཏབ་བོ། །ས་གཞི་ཀུན་དུ་མེ་ཏོག་སྣ་ཚོགས་གཅལ་དུ་བཀྲམ་མོ།
en: Fragrant water was sprinkled in all the lanes of the city, and fresh flowers were spread all over the ground.

source: །དེའི་ཚེ་ལྷའི་བུ་མོ་དང་། ལྷ་མ་ཡིན་གྱི་བུ་མོ་དང་། སྒྲ་གཅན་ཟིན་གྱི་བུ་མོ་གྲངས་མེད་ཚད་མེད་པ་ཡང་རབ་ཏུ་དགའ་བའི་སེམས་བསྐྱེད་ནས། བྱང་ཆུབ་ཀྱི་རྒྱུ་མངོན་པར་བསྒྲུབ་པར་འདོད་པའི་ཕྱིར་དེར་འོངས་ནས་གྲོང་ཁྱེར་ཆེན་པོ་ཁྱད་པར་དུ་འཕགས་པ་དེ་རབ་ཏུ་བརྒྱན་ཏོ།
en: At that time, innumerable goddesses, female asuras, and daughters of Rāhula were thrilled and came with the desire to accomplish the cause of awakening, adorning that magnificent great city with their presence.

source: །དེ་ནས་ཟླ་འོད་གཞོན་ནུར་གྱུར་པ་གྲོང་ཁྱེར་དེ་ཀུན་དུ་ཁྱབ་པར་བརྒྱན་ཅིང་ཡོངས་སུ་དག་པ་དང་གདུགས་ཚོད་ལ་བབ་པར་རིག་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སེམས་ཅན་རྣམས་ལ་སྨན་པར་མཛད་པའི་སླད་དུ་གྲོང་ཁྱེར་ཆེན་པོར་གཤེགས་སུ་གསོལ།
en: Once Candraprabhakumārabhūta knew that the entire city had been cleaned and decorated and it was time for the noon meal, he addressed the Blessed One, “Blessed One, please come to this city in order to heal sentient beings!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་འཁོར་མང་པོ་དང་ཐབས་ཅིག་ཏུ་གྲོང་ཁྱེར་དུ་གཤེགས་ནས་སྒོའི་ཐེམ་པ་ལ་ཞབས་བཞག་མ་ཐག་ཏུ་གྲོང་ཁྱེར་ཆེན་པོ་དེའི་ས་ཆེན་པོ་ཡང་རབ་ཏུ་གཡོས་པར་གྱུར། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་འབུམ་ཕྲག་བརྒྱ་སྟོང་ཚད་མེད་པ་ཡང་རབ་ཏུ་གཡོས་པར་གྱུར་ཏེ། དེའི་ཚེ་ལོང་བ་དག་ནི་གཟུགས་མཐོང་བར་གྱུར། སྡུག་བསྔལ་བ་རྣམས་ནི་བདེ་བ་ཐོབ་པར་གྱུར། འོན་པ་རྣམས་ནི་སྒྲ་ཐོས་པར་གྱུར།
en: The Blessed One arrived at the city with his many retinues, and as soon as he stepped through the city gate, the ground of that great city and countless billions of universes in the ten directions began to shake.

source: བྱད་བཞིན་མི་སྡུག་པ་རྣམས་ནི་བྱད་བཞིན་བཟང་པོ་ཐོབ་པར་གྱུར། ནོར་མེད་པ་རྣམས་ནི་ནོར་དང་ལྡན་པར་གྱུར། བུ་མེད་པ་རྣམས་ནི་བུ་ཡོད་པར་གྱུར། གོས་མེད་པ་རྣམས་ནི་གོས་ཐོབ་པར་གྱུར། རིན་པོ་ཆེ་མེད་པ་རྣམས་ནི་རིན་པོ་ཆེ་ཐོབ་པར་གྱུར།
en: At that moment, those who were blind could see, those who were suffering became happy, those who were deaf could hear, those who were ugly became handsome, those who were poor became wealthy, those who were childless had children, those who had no clothes received clothes, those who had no jewels received jewels, those who had no friends gained friends, and those who had no physical ornaments received all kinds of physical ornaments.

source: ཉེ་བཤེས་མེད་པ་རྣམས་ནི་ཉེ་བཤེས་དང་ལྡན་པར་གྱུར། ལུས་ཀྱི་རྒྱན་ཐམས་ཅད་ཀྱིས་ཕོངས་པ་རྣམས་ནི་ལུས་ཀྱི་རྒྱན་ཐམས་ཅད་དང་ལྡན་པར་གྱུར་ཏོ། །གཞན་ཡང་ངང་པ་དང་། ཁྲུང་ཁྲུང་དང་། ནེ་ཙོ་དང་། རྨ་བྱ་དང་། ཀ་རི་ཀ་ལ་སོགས་པ་བྱའི་ཚོགས་མང་པོ་རྣམས་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དང་། རབ་ཏུ་དགའ་བའི་སེམས་བསྐྱེད་ནས་སྒྲ་སྙན་ཅིང་ཡིད་དུ་འོང་བ་མཆོག་དམ་པ་ཕྱུང་སྟེ། གང་གིས་སྒྲ་དེ་དག་ཐོས་པ་ཡང་ཡིད་ཤིན་ཏུ་བདེ་བར་གྱུར་ཏོ།
en: Upon seeing the Thus-Gone One, many groups of birds such as swans, cranes, parrots, peacocks, and crows became overjoyed and started to sing the most pleasant and sublime songs, which brought immense delight to those who heard them.

source: །གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་ཙམ་པ་ཀའི་ལྗོན་ཤིང་ཚད་མེད་པ་སྙེད་མངོན་པར་སྤྲུལ་པས། སེམས་ཅན་བརྒྱ་སྟོང་མང་པོ་རྣམས་མེ་ཏོག་ཡོངས་སུ་དག་པ་དེ་དག་དང་། གཞན་ཡང་སྤོས་མཆོག་དམ་པ་ཐོགས་ནས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་གཏོར་ཏེ་མཆོད་པ་བྱས་སོ།
en: Miraculously, the Thus-Gone One also emanated countless magnolia trees, and many hundreds of thousands of sentient beings worshiped the Blessed One by proffering fresh flowers as well as the most fragrant perfumes and strewing them upon him.

source: །གཞན་ཡང་ལྷ་མ་ཡིན་གྱི་བུ་མོ་དབང་ཕྱུག་ཐོབ་པ་བརྒྱ་སྟོང་དུ་མ་མུ་ཏིག་དམར་པོ་དང་། ཙན་དན་གྱི་ཕྱེ་མ་ཐོགས་ནས་དེ་བཞིན་གཤེགས་པ་ལ་རབ་ཏུ་དགའ་བས་མངོན་པར་གཏོར་ཏོ།
en: Many hundreds of thousands of mighty female asuras carried red pearls and sandalwood powders, which they joyfully tossed at the Thus-Gone One.

source: །ལྷ་མ་ཡིན་མང་པོ་དང་། གཞན་ཡང་ལྷ་མང་པོ་རྣམས་རིན་པོ་ཆེའི་གདུགས་གསེར་དང་། དངུལ་གྱིས་རབ་ཏུ་བརྒྱན་པ་ཐོགས་ནས་བར་སྣང་ལ་འདུག་སྟེ། དེ་བཞིན་གཤེགས་པའི་སྟེང་དུ་ཁེབས་པར་གཡོགས་སོ།
en: Many asuras and gods were also present in the sky, sheltering the Thus-Gone One by holding bejeweled parasols adorned with gold and silver above his head.

source: །གཞན་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་ཙན་དན་གྱི་ལྗོན་ཤིང་དང་། གསེར་གྱི་ལྗོན་ཤིང་དང་། རིན་པོ་ཆེའི་སྣོད་དང་། གོས་ལ་སོགས་པའི་ལྗོན་ཤིང་བརྒྱ་སྟོང་ཚད་མེད་དཔག་ཏུ་མེད་པ་རིན་པོ་ཆེ་རྣམས་ཀྱིས་བརྒྱན་པ།
en: Through his miraculous powers, the Blessed One manifested countless hundreds of thousands of sandalwood trees, golden trees, and trees filled with jeweled vessels and cloths.

source: མེ་ཏོག་དང་། ལོ་མ་ཕུན་སུམ་ཚོགས་ཤིང་རྒྱས་པ།
en: Those trees were adorned with precious gems and with magnificent blooming flowers and leaves;

source: སེམས་ཅན་ཚད་མེད་པའི་བསོད་ནམས་ཀྱི་རྣམ་པར་སྨིན་པའི་འབྲས་བུ་ཐུན་མོང་དུ་མངོན་པར་གྲུབ་པ།
en: they all manifested as the result of the collective karmic ripening of countless beings’ merit.

source: རླུང་གི་ངད་ལངས་པ་ཙམ་གྱིས་སྤོས་མཆོག་དམ་པའི་དྲིས་སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་པ་རྣམས་ཀུན་ཏུ་ཁྱབ་པར་གང་བ་མངོན་པར་སྤྲུལ་ཏོ།
en: Whenever the wind blew, the fragrance of their sublime perfumes pervaded innumerable buddha realms.

source: །སེམས་ཅན་བརྒྱ་སྟོང་ཚད་མེད་པ་རྣམས་ཀྱིས་ཀྱང་དུས་གཅིག་ཏུ་མེ་ཏོག་ཐོགས་ནས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་གཏོར་ཏོ།
en: Countless hundreds of thousands of sentient beings also held up flowers at the same time and tossed them upon the Blessed One.

source: །དེ་བཞིན་དུ་སེམས་ཅན་མ་ཡིན་པ་ཚད་མེད་པ་རྣམས་ཀྱང་དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་མངོན་པར་སྤྲུལ་པ་ཤ་སྟག་གོ །གང་དག་ཅི་དང་ཅི་སྨོན་པ་དེ་དག་ཀྱང་རྫུ་འཕྲུལ་གྱི་དབང་གིས་དེ་དག་གི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རེ་བ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཏོ།
en: Similarly, countless insentient manifestations were also emanated solely through the Thus-Gone One’s miraculous powers. Through his miraculous powers, all beings’ wishes were completely fulfilled in accordance with their individual aspirations.

source: །བཅོམ་ལྡན་འདས་གྲོང་ཁྱེར་དུ་གཤེགས་པའི་ཚེ་འཁོར་འདུས་པ་ཐམས་ཅད་ནམ་མཁའ་ལ་ཁྱད་པར་དུ་འཕགས་པའི་སྒྲ་བསམ་གྱིས་མི་ཁྱབ་པར་ཡང་དག་པར་སྟོན་པའི་སྒྲ་ཐོས་པར་གྱུར་ཀྱང་དེ་གང་ནས་བྱུང་བ་ཤེས་པར་ཡང་མ་གྱུར་ལ་ཚིགས་སུ་བཅད་པ་བརྒྱ་སྟོང་དུ་མས་ཀྱང་ཆོས་རྣམས་ཡང་དག་པར་བསྟན་པར་གྱུར་ཏོ།
en: When the Blessed One arrived in the city, the entire assembly heard extraordinary and inconceivable words of instruction that rang out in the sky, no one knowing where the words came from. In this way, Dharma teachings were uttered in many hundreds of thousands of verses.

source: །བཅོམ་ལྡན་འདས་ནི་གྲོང་ཁྱེར་ཞུགས་པའི་ཚེ།
en: When the Blessed One entered the city,

source: མཁའ་ལས་སྒྲ་ནི་འདི་སྐད་གྲགས་པར་གྱུར།
en: These words resounded in the sky:

source: །འདོད་ཆགས་ཟད་མཐའ་སྟོང་དབེན་གང་རྟོགས་པ།
en: “Those who realize the limit of the exhaustion of desire to be empty and void

source: །ཡང་དག་ཉིད་རྟོགས་བྱང་ཆུབ་ཐོབ་པར་འགྱུར།
en: Will realize reality and achieve awakening.”

source: །མཁའ་ལས་སྒྲ་ནི་འདི་སྐད་གྲགས་པར་གྱུར།
en: These words resounded in the sky:

source: །འདོད་ཆགས་སྐྱེ་མཐའ་སྟོང་དབེན་གང་རྟོགས་པ།
en: “Those who realize the limit of the arising of desire to be empty and void

source: །འདོད་ཆགས་མཐའ་ནི་སྟོང་དབེན་གང་རྟོགས་པ།
en: “Those who realize the limit of desire to be empty and void

source: །འདོད་ཆགས་རབ་ཞི་སྟོང་དབེན་གང་རྟོགས་པ།
en: “Those who realize the peace of desire to be empty and void

source: །འདོད་ཆགས་འཇུག་པ་སྟོང་དབེན་གང་རྟོགས་པ།
en: “Those who realize the cognition of desire to be empty and void

source: །འདོད་ཆགས་མེད་ཅིང་སྟོང་དབེན་གང་རྟོགས་པ།
en: “Those who realize that desire is nonexistent, empty, and void

source: །འདོད་ཆགས་སྐྱེ་མེད་སྟོང་དབེན་གང་རྟོགས་པ།
en: “Those who realize that desire is unborn, empty, and void

source: །འདོད་ཆགས་རབ་འགོག་སྟོང་དབེན་གང་རྟོགས་པ།
en: “Those who realize the complete cessation of desire to be empty and void

source: །ཞེ་སྡང་གཏི་མུག་ཁོང་ཁྲོ་འཆབ་སེར་སྣ།
en: Aggression, pretense, miserliness,

source: །གཡོ་སྒྱུ་ཁེངས་དང་ང་རྒྱལ་མྱ་ངན་དང་། །སྡུག་བསྔལ་ཀུན་འབྱུང་འགོག་པ་ལམ་སེམས་ཅན།
en: Deceit, arrogance, pride, misery, Suffering, origin, cessation, path,

source: །ཁྱེའུ་དང་བུ་མོ་བུད་མེད་དག་དང་ནི།
en: “Sentient beings, boys, girls, women, men, living creatures,

source: །སྐྱེས་པ་གསོ་བ་དག་དང་དབང་པོ་དྲུག །ཡུལ་དྲུག་འབྱུང་ཆེན་བཞི་ཡི་དངོས་པོ་དང་། །འཇིག་རྟེན་སྡུག་བསྔལ་ཕུང་པོ་ཁམས་དག་དང་། །འཇིག་རྟེན་སྐྱེ་སྒྲ་མིང་སོགས་ཀྱང་དེ་བཞིན།
en: The six faculties, the six objects, the four great elements, The world, suffering, the aggregates, the elements, Worldly arising, words, names, and so forth.”

source: །ཆོས་རྗེ་དམ་པའི་ཆོས་ནི་བསྟན་པས་ན།
en: Through those teachings of the Dharma lord,

source: །སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་དགའ་བར་གྱུར།
en: All sentient beings were overjoyed,

source: །ལྷ་ཡི་འཇིག་རྟེན་ཀུན་ཀྱང་ཐོས་གྱུར་ནས།
en: And, upon hearing them, all the inhabitants of the divine worlds

source: །དེ་བཞིན་གཤེགས་པའི་ཐེག་ལ་གནས་པར་མོས།
en: Formed the wish to follow the vehicle of the Thus-Gone One.

source: །བཅོམ་ལྡན་སྦྱིན་སྟོབས་དག་ལ་རབ་མོས་པས།
en: “Since the Blessed One was so dedicated to the strength of generosity,

source: །སྦྱིན་པའི་སྟོབས་ཀྱིས་བྱང་ཆུབ་བརྙེས་པར་གྱུར།
en: He reached awakening through the strength of generosity.”

source: །བཅོམ་ལྡན་ཚུལ་ཁྲིམས་རྣམ་དག་རབ་མོས་པས།
en: “Since the Blessed One was so dedicated to pure discipline,

source: །ཚུལ་ཁྲིམས་རྣམ་དག་སྟོབས་ཀྱིས་བྱང་ཆུབ་བརྙེས།
en: He reached awakening through the strength of pure discipline.”

source: །བཅོམ་ལྡན་བཟོད་པ་དག་ལ་རབ་མོས་པས།
en: “Since the Blessed One was dedicated to pure patience,

source: །བཟོད་པའི་སྟོབས་ཀྱིས་བྱང་ཆུབ་བརྙེས་པར་གྱུར།
en: He reached awakening through the strength of that patience.”

source: །བཅོམ་ལྡན་བརྩོན་འགྲུས་དག་ལ་རབ་མོས་པས།
en: “Since the Blessed One was dedicated to pure diligence,

source: །བརྩོན་འགྲུས་སྟོབས་ཀྱིས་བྱང་ཆུབ་བརྙེས་པར་གྱུར།
en: He reached awakening through the strength of that diligence.”

source: །བཅོམ་ལྡན་བསམ་གཏན་དག་ལ་རབ་མོས་པས།
en: “Since the Blessed One was dedicated to pure concentration,

source: །བསམ་གཏན་སྟོབས་ཀྱིས་བྱང་ཆུབ་བརྙེས་པར་གྱུར།
en: He reached awakening through the strength of that concentration.”

source: །བཅོམ་ལྡན་ཤེས་རབ་དག་ལ་རབ་མོས་པས།
en: “Since the Blessed One was dedicated to pure insight,

source: །ཤེས་རབ་སྟོབས་ཀྱིས་བྱང་ཆུབ་བརྙེས་པར་གྱུར།
en: He reached awakening through the strength of that insight.

source: །རྫུ་འཕྲུལ་མངོན་ཤེས་ཡོན་ཏན་གནས་ཤེས་སྟོབས།
en: “The same also applies to the strengths of miraculous powers, The higher perceptions, the qualities, the knowledge of past lives,

source: །ཐབས་དང་གཟུངས་ཀྱི་སྟོབས་དང་གྲགས་པའི་སྟོབས།
en: Skill in means, retention, renown,

source: །ལས་དང་རྟེན་འབྱུང་ཡན་ལག་དད་དང་ཐོས།
en: Faith in karma and in the branches of dependent origination, learning,

source: །སྟོང་དང་འཐུན་པའི་སྟོབས་དང་རབ་ཞི་སྟོབས།
en: “Harmony with emptiness, peace, complete control,

source: །རབ་དུལ་ཡང་དག་མཐའ་དང་དབེན་མཁས་སྟོབས།
en: Expertise in the ultimate limit and voidness, fear, delight, altruism,

source: །འཇིགས་དང་དགའ་དང་ཕན་འདོགས་ལ་མོས་དང་། །བྱམས་དང་སྙིང་རྗེ་དགའ་སྙོམས་བཟོད་འཚེ་མེད།
en: Love, compassion, joy, equanimity, acceptance, harmlessness,

source: །སྟོང་དང་མཚན་མ་མེད་སོགས་ཀྱང་དེ་བཞིན།
en: The realization of emptiness, the absence of marks, and so forth.”

source: །སྟོབས་བཅུ་འཕགས་པའི་མངའ་བདག་ལྷ་ཡི་གཙོ།
en: When the noble master endowed with the ten powers

source: །ཡོན་ཏན་གྲགས་པ་དཔེ་ཟླ་མ་མཆིས་པ།
en: The divine lord unmatched in terms of qualities and glory—

source: །གྲོང་ཁྱེར་མཆོག་གཤེགས་ཞབས་ནི་བཞག་པའི་ཚེ།
en: Came and walked in this sublime city,

source: །སེམས་ཅན་རྣམས་ལ་རྒྱ་ཆེར་ཕན་པ་མཛད།
en: He benefitted sentient beings extensively.

source: །སྔོན་ཆད་སྲིད་གསུམ་ལས་དགེ་རབ་བསྒྲུབས་པས།
en: Since they had performed virtuous actions in the three realms in the past,

source: །ལྷ་ཡི་དགེ་བ་སྣ་ཚོགས་འཕེལ་བར་མཛད།
en: He caused the various virtues of the gods to increase.

source: །འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་ནི་རབ་ཏུ་བཀུར།
en: All worldly beings revered him and listened to his teachings,

source: །ང་ཡི་བསྟན་པ་འདི་ཐོས་ཐམས་ཅད་དགའ།
en: And everyone was filled with joy.

source: །བཅོམ་ལྡན་གྲོང་ཁྱེར་གཤེགས་ནས་ཞབས་བཞག་ཚེ།
en: When the Blessed One came and walked in this sublime city,

source: །གྲོང་ཁྱེར་ས་ཆེན་དག་ནི་རབ་ཏུ་གཡོས།
en: The vast ground of the city started to shake.

source: །བཅོམ་ལྡན་རྣམ་དག་འོད་ཟེར་མཐོང་བས་ན།
en: When they saw the completely pure lights emitted by the Blessed One,

source: །ངོ་མཚར་མི་འཛིན་མི་དགའ་གང་ཡང་མེད།
en: Everyone was amazed and thrilled.

source: །བཅོམ་ལྡན་གྲོང་གཤེགས་ཕན་པ་ཆེར་མཛད་པས།
en: Since the Blessed One came to that city and benefitted beings extensively,

source: །ལྷ་མིའི་འཁོར་རྣམས་སེམས་ནི་དགའ་བར་གྱུར།
en: The retinues of gods and humans were delighted,

source: །ས་དང་མཁའ་འགྲོ་དག་གིས་སྲིད་གསུམ་ན། །བཅོམ་ལྡན་ཤིན་ཏུ་བདེ་ཞེས་བསྔགས་པར་གྱུར།
en: And beings residing on the earth and in the sky praised him by saying, “The Blessed One brings the highest happiness to the three realms!”

source: །བཅོམ་ལྡན་ཞབས་ཀྱི་འཁོར་ལོ་ས་བཞག་ཚེ།
en: When the Blessed One placed the wheels of his feet on the ground,

source: །རྣམ་དག་འོད་ཟེར་ཀུན་གསལ་ངོ་མཚར་གྱུར།
en: Pure light illuminated the place, amazing everyone.

source: །རྟ་ནི་ཅང་ཤེས་གྲོང་ཁྱེར་སྒྲ་སྙན་ཕྱུང་།
en: The delightful sounds of thoroughbred horses resounded in the city,

source: །བྱ་ཚོགས་དག་ཀྱང་མཁའ་ལས་རབ་ཏུ་དགའ།
en: And the birds flying in the sky were overjoyed.

source: །གཞན་ཡང་རབ་དང་བུད་མེད་མང་པོ་ཡི།
en: Melodious tunes also manifested spontaneously

source: །ལག་དང་རྐང་དང་གདུབ་འཁོར་ཕྲེང་བ་དང་། །དེ་བཞིན་རིན་ཆེན་རྒྱན་ནི་སྣ་ཚོགས་ལས།
en: From the bracelets, anklets, necklaces, And various other precious ornaments

source: །མ་དཀྲོལ་བ་ཡང་རང་ལས་སྒྲ་སྙན་བྱུང་།
en: Of the many faithful maidens, without anyone playing the ornaments.

source: །སོ་སོར་ཕན་ཚུན་དགའ་བའི་གཏམ་བརྗོད་ཅིང་།
en: Everyone conversed joyfully and complimented one another

source: །སྐད་འཐུན་བཀྲ་ཤིས་མཆོག་གིས་བསྔགས་པ་བརྗོད།
en: With the most agreeable and auspicious words.

source: །འོན་ལོང་དབང་པོ་མ་ཚང་དབང་པོ་ཐོབ།
en: Those who were blind, deaf, or with other faculties impaired

source: །ཐམས་ཅད་བཅོམ་ལྡན་ཁྱད་འཕགས་འབྲས་བུ་དབང་།
en: Recovered the full ability of their senses.

source: །བཅོམ་ལྡན་གྲོང་ཁྱེར་གཤེགས་ཚེ་ཀུན་དགའ་བས།
en: When the Thus-Gone One came to the city,

source: །ལྷ་མིས་མེ་ཏོག་མངོན་པར་མཆོད་པ་བྱས།
en: Gods and humans joyfully offered him flowers,

source: །མཁའ་ལས་ཀུན་དུ་སྒྲ་སྙན་བྱུང་བས་ན།
en: And melodious tunes resounded everywhere in the sky,

source: །ལྷ་ཚོགས་ཚད་མེད་རབ་ཏུ་དགའ་བར་གྱུར།
en: Bringing delight to countless groups of gods.

source: །གཞན་ཡང་སེམས་ཅན་དྲན་པ་ཉམས་པ་དག །སྨྱོས་འཁྲུགས་རབ་ཞི་ཕན་ཚུན་གཏམ་སྙན་བརྗོད།
en: Beings with impaired memory had their derangements pacified, And they began to speak pleasantly to one another.

source: །བུད་མེད་གང་སྦྲུམ་མྱ་ངན་འཇིགས་གྱུར་པ།
en: Pregnant women who were distressed and anxious

source: །འོད་ཟེར་བྱིན་གྱིས་བདེ་བ་ཐོབ་པར་གྱུར། །སྐྱེས་པ་བུད་མེད་ངོ་ཚ་ཁྲེལ་བཅས་ལ།
en: Were comforted by the magnificence of those lights.

source: །དྲི་མ་སྤངས་པའི་ཆོས་དག་རབ་བཤད་པས།
en: Undefiled Dharma teachings were expounded To the modest and humble men and women,

source: །ཐམས་ཅད་དགའ་ནས་དག་པའི་སེམས་བསྐྱེད་དེ།
en: Causing all of them to joyfully give rise to a pure mindset

source: །ཐུབ་མཆོག་ཞབས་ལ་སྤྱི་བཏུད་ཕྱག་བྱས་ནས།
en: And to prostrate to the feet of the supreme lord.

source: །ཁ་ཅིག་བཅོམ་ལྡན་བླ་མེད་ལམ་རབ་ཚོལ།
en: Some of them pursued the unsurpassed path of the blessed ones,

source: །ཁ་ཅིག་བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་ཚོལ།
en: And some pursued the path of the bodhisattvas or the path of the hearers.

source: །བཅོམ་ལྡན་གྲོང་ཁྱེར་མཆོག་ཏུ་གཤེགས་པས་ན།
en: When the Blessed One came to the sublime city,

source: །བཅོམ་ལྡན་ཞལ་དུ་ལྟ་ཞིང་རང་ཉིད་དགའ།
en: Everyone delighted in gazing at the face of the Blessed One.

source: །བཅོམ་ལྡན་མཁྱེན་པས་ས་ཡི་སྤྱོད་རྟོགས་པས།
en: Knowing the customs of that land through his wisdom,

source: །འཇིག་རྟེན་རྗེས་འཐུན་ཕན་པ་རབ་ཏུ་མཛད།
en: The Blessed One benefitted them in accordance with the ways of the world.

source: །ཆོས་ཀྱི་ནོར་མཆོག་བྱང་ཆུབ་སེམས་དཔའ་བྱིན།
en: He bestowed the supreme wealth of the Dharma on the bodhisattvas

source: །རིན་ཆེན་མཆོག་ནི་སེམས་ཅན་རྣམས་ལ་བཏང་།
en: And gave supreme riches to other sentient beings.

source: །བཅོམ་ལྡན་གྲོང་ཁྱེར་གཤེགས་པའི་ཚེ།
en: When the Blessed One came to the city,

source: །མཁའ་ལས་སྒྲ་ནི་འདི་སྐད་བྱུང་།
en: These words resounded in the sky:

source: །གང་ཞིག་མིག་ཟད་མཐའ་སྲེད་པ།
en: “Those who crave the limit of the exhaustion of the eye

source: །སངས་རྒྱས་ལ་ནི་གུས་པ་ཡིན།
en: Revere the Buddha.”

source: །གང་ཞིག་མིག་སྐྱེ་མཐའ་སྲེད་པ།
en: “Those who crave the limit of the arising of the eye

source: །སངས་རྒྱས་ཡིད་ཆེས་མི་འཇིགས་འཐོབ།
en: Will develop fearless trust in the Buddha;
